"""
Задача-1. Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел
и строк и сохраните в переменные, выведите на экран.
"""

a = input("Введите своё имя: ")
b = int(input("Введите ваш возраст: "))
c = float(input("Введите ваш рост(см): "))

end = '\n'

print("Имя: "+a, '\n' "Возраст: "+str(b), '\n' "Рост(см): "+str(c))
